#+Include: ../../doc.templates/title-injects.org
#+Include: ../../preamble.org

** DONE Rumor 

#+name: rumor  
#+begin_src R :exports both :dir ../../doc.generation/mustache :results value org drawer :cache no :var iduser=usercode day=39
library(whisker)
cs <- read.csv2("../../data.out/ft_rumors.csv", sep=";", header=TRUE, skip=0, 
  na.strings=c("","nil"), stringsAsFactors=FALSE)
cs <- cs[order(cs$IdRumor,cs$IdPerson), ]

cs <- cs[cs$IdUser==iduser,]
cs <- cs[cs$Day==day,]

cs$rank <- sequence(rle(cs$IdRumor)$lengths)
cs$F <- cs$rank==1

sel <- if (nrow(cs)>0) {which( with( cs, 
 {tmp <- logical(length(cs$IdRumor)); 
 split(tmp, cs$IdRumor) <- lapply(split(rank, cs$IdRumor), function(x) x==max(x));
 tmp}))}

if (nrow(cs)>0) {cs$L <- F; cs$L[sel]<-T}

rumor <- unname(rowSplit(cs))

f <- "rumor.org"
contents <- readChar(f, file.info(f)$size)
f <- "person.org"
person <- readChar(f, file.info(f)$size)
f <- "symptoms.org"
symptoms <- readChar(f, file.info(f)$size)

text <- whisker.render(contents, partials=list(person=person, symptoms=symptoms))
text <- gsub("[\r]", "", text)
text
#+end_src

#+RESULTS: rumor
:RESULTS:

   
   /Rumor [fn:: Place -- 202]/

   #+Attr_Latex: :center nil :booktabs t
   |----------------------+--------------------------------------------------|
   | Notified by          | Akinola Obanor                   |
   | \ldots Phone         | 0802-7978377 mobile                    |
   | \ldots Email         | akinola.obanor@sormas-n.ng                                      |
   |----------------------+--------------------------------------------------|
   | Date of Event        | 2015-07-09                                    |
   | Type of Place        | Home                        |
   | Address              | Golf Course Road \ldots Shabe         |
   | LGA \ldots State     | Saki West \ldots  Oyo              |
   | Description of Place | /Please describe the place with your own words./ |
   | Rumor Description    | /After having viewed all information/            |
   |                      | /please invent further details and/              |
   |                      | /describe the rumor with your own words./        |
   |----------------------+--------------------------------------------------|
  
   $\ldots$ /Person [fn:: Person -- 149]/
   
   #+Attr_Latex: :center nil :booktabs t
   | Description of Person | /This person seemed very sick./ |
   
      #+Attr_Latex: :center nil :booktabs t
   |---------------------------+-------------------------------------------------------------------------------------------+----------|
   | Name                      | Olafimihan Awosola                                                                |          |
   | Sex \ldots Age \ldots DoB | male \ldots 43 \ldots                                      |
   | Marital State             | separated (not living common law)                                                                          |          |
   | Home Address              | Igunsi Lane \ldots Daho \ldots Albasu \ldots Kano                            |          |
   | Phone-1                   | +234-805-5684038 mobile                                                                 |          |
   | Phone-2                   | NA NA                                                                 |          |
   | Occupation                | soldier                                                                            |          |
   |---------------------------+-------------------------------------------------------------------------------------------+----------|
        
   $\ldots$ /Person [fn:: Person -- 320]/
   
   #+Attr_Latex: :center nil :booktabs t
   | Description of Person | /This person has touched the sick one./ |
   
      #+Attr_Latex: :center nil :booktabs t
   |---------------------------+-------------------------------------------------------------------------------------------+----------|
   | Name                      | Yakubu Latifu                                                                |          |
   | Sex \ldots Age \ldots DoB | male \ldots 19 \ldots                                      |
   | Marital State             | married (and not separated)                                                                          |          |
   | Home Address              | Ogbeifun Lane \ldots Taura \ldots Dawakin Tofa \ldots Kano                            |          |
   | Phone-1                   | +234-813-7938811 mobile                                                                 |          |
   | Phone-2                   | NA NA                                                                 |          |
   | Occupation                | management accountant                                                                            |          |
   |---------------------------+-------------------------------------------------------------------------------------------+----------|
        
   $\ldots$ /Person [fn:: Person -- 4254]/
   
   #+Attr_Latex: :center nil :booktabs t
   | Description of Person | /This person was standing nearby./ |
   
      #+Attr_Latex: :center nil :booktabs t
   |---------------------------+-------------------------------------------------------------------------------------------+----------|
   | Name                      | Nifemi Afikuyomi                                                                |          |
   | Sex \ldots Age \ldots DoB | male \ldots 28 \ldots                                      |
   | Marital State             | married (and not separated)                                                                          |          |
   | Home Address              | Chief Dr.Ofili Ugwudioha Street \ldots Muwa \ldots Saki West \ldots Oyo                            |          |
   | Phone-1                   | 0805-6519155 mobile                                                                 |          |
   | Phone-2                   | NA NA                                                                 |          |
   | Occupation                | dish washer                                                                            |          |
   |---------------------------+-------------------------------------------------------------------------------------------+----------|
        
   $\ldots$ /Person [fn:: Person -- 4280]/
   
   #+Attr_Latex: :center nil :booktabs t
   | Description of Person | /This person was standing nearby./ |
   
      #+Attr_Latex: :center nil :booktabs t
   |---------------------------+-------------------------------------------------------------------------------------------+----------|
   | Name                      | Adejoke Ogundana                                                                |          |
   | Sex \ldots Age \ldots DoB | female \ldots 34 \ldots                                      |
   | Marital State             | single (not living common law)                                                                          |          |
   | Home Address              | Mbanugo Street \ldots Ifelodun \ldots Saki West \ldots Oyo                            |          |
   | Phone-1                   | +234-807-5553998 mobile                                                                 |          |
   | Phone-2                   | NA NA                                                                 |          |
   | Occupation                | confectioner (pastry and cake maker)                                                                            |          |
   |---------------------------+-------------------------------------------------------------------------------------------+----------|
        
   $\ldots$ /Person [fn:: Person -- 4428]/
   
   #+Attr_Latex: :center nil :booktabs t
   | Description of Person | /This person has touched the sick one./ |
   
      #+Attr_Latex: :center nil :booktabs t
   |---------------------------+-------------------------------------------------------------------------------------------+----------|
   | Name                      | Obiora Erese                                                                |          |
   | Sex \ldots Age \ldots DoB | male \ldots 60 \ldots                                      |
   | Marital State             | married (and not separated)                                                                          |          |
   | Home Address              | UNTH Road Extension \ldots Irawo \ldots Saki West \ldots Oyo                            |          |
   | Phone-1                   | 038-8513612 landline                                                                 |          |
   | Phone-2                   | NA NA                                                                 |          |
   | Occupation                | employment agent (employment officer)                                                                            |          |
   |---------------------------+-------------------------------------------------------------------------------------------+----------|
        
   $\ldots$ /Person [fn:: Person -- 4471]/
   
   #+Attr_Latex: :center nil :booktabs t
   | Description of Person | /This person was standing nearby./ |
   
      #+Attr_Latex: :center nil :booktabs t
   |---------------------------+-------------------------------------------------------------------------------------------+----------|
   | Name                      | Osaruese Dikeh                                                                |          |
   | Sex \ldots Age \ldots DoB | male \ldots 15 \ldots                                      |
   | Marital State             | single (not living common law)                                                                          |          |
   | Home Address              | Nonso Mba Street \ldots Ladele \ldots Saki West \ldots Oyo                            |          |
   | Phone-1                   | 0806-2888058 mobile                                                                 |          |
   | Phone-2                   | 0813-1891911 mobile                                                                 |          |
   | Occupation                | trainee                                                                            |          |
   |---------------------------+-------------------------------------------------------------------------------------------+----------|
        
   $\ldots$ /Person [fn:: Person -- 4472]/
   
   #+Attr_Latex: :center nil :booktabs t
   | Description of Person | /This person was standing nearby./ |
   
      #+Attr_Latex: :center nil :booktabs t
   |---------------------------+-------------------------------------------------------------------------------------------+----------|
   | Name                      | Ofey Shakpoke                                                                |          |
   | Sex \ldots Age \ldots DoB | female \ldots 54 \ldots                                      |
   | Marital State             | separated (not living common law)                                                                          |          |
   | Home Address              | Niwil Close \ldots Idi Apa \ldots Saki West \ldots Oyo                            |          |
   | Phone-1                   | +234-818-5017199 mobile                                                                 |          |
   | Phone-2                   | NA NA                                                                 |          |
   | Occupation                | electrician                                                                            |          |
   |---------------------------+-------------------------------------------------------------------------------------------+----------|
   
   $\blacksquare$ \medskip 
   

:END:

** DONE Contact

#+name: contact  
#+begin_src R :exports both :dir ../../doc.generation/mustache :results value org drawer :cache no :var iduser=usercode day=15
library(whisker)
cs <- read.csv2("../../data.out/ft_contacts.csv", sep=";", header=TRUE, skip=0, 
  na.strings=c("","nil"), stringsAsFactors=FALSE)
cs <- cs[order(cs$IdCase, cs$IdPerson), ]

cs <- cs[cs$IdUser==iduser,]
cs <- cs[cs$Day==day,]

contact <- unname(rowSplit(cs))

f <- "contact.org"
contents <- readChar(f, file.info(f)$size)
f <- "person.org"
person <- readChar(f, file.info(f)$size)

text <- whisker.render(contents, partials=list(person=person))
text <- gsub("[\r]", "", text)
text
#+end_src

#+RESULTS: contact
:RESULTS:

   /Contact [fn:: \\ Case -- 2\\ Contact person -- 4402]/

   #+Attr_Latex: :center nil :booktabs t
   |---------------------------+-----------------------------------------------------------|
   | Name                      | Sesugh Ogunode                        |
   | Sex \ldots DoB \ldots Age | male \ldots 17 \ldots 1998-05-03 |
   |---------------------------+-----------------------------------------------------------|
   
      #+Attr_Latex: :center nil :booktabs t
   |---------------------------+-------------------------------------------------------------------------------------------+----------|
   | Name                      | Lola Oshaniwa                                                                |          |
   | Sex \ldots Age \ldots DoB | female \ldots 54 \ldots 1960-11-19                                     |
   | Marital State             | married (and not separated)                                                                          |          |
   | Home Address              | Iskalu Lane \ldots Mejaw \ldots Saki West \ldots Oyo                            |          |
   | Phone-1                   | 038-5438034 landline                                                                 |          |
   | Phone-2                   | 0806-8888772 mobile                                                                 |          |
   | Occupation                | soldier                                                                            |          |
   |---------------------------+-------------------------------------------------------------------------------------------+----------|

   #+Attr_Latex: :center nil :booktabs t
   |----------------------+--------------------------------------------------|
   | Date of Last Contact | 2015-06-08                                    |
   | Type of Contact      | had direct physical contact with the body of the case (alive or dead)                           |
   | Type of Place        | Home                       |
   | Address              | Iskalu Lane \ldots Mejaw         |
   | LGA \ldots State     | Saki West \ldots Oyo               |
   | Description of Place | /Please describe the place with your own words./ |
   | Description          | /After having viewed all information/            |
   |                      | /please invent further details and/              |
   |                      | /describe the rumor with your own words./        |
   |----------------------+--------------------------------------------------|
 
   \medskip


:END:

** DONE Symptomatic Person

#+name: sperson  
#+begin_src R :exports both :dir ../../doc.generation/mustache :results value org drawer :cache no :var iduser=usercode day=15
library(whisker)
cs <- read.csv2("../../data.out/ft_cases.csv", sep=";", header=TRUE, skip=0, 
  na.strings=c("","nil"), stringsAsFactors=TRUE)
cs <- cs[order(cs$IdPerson, cs$LastName), ]
cs <- cs[cs$IdUser==iduser,]
cs <- cs[cs$Day==day,]
case <- unname(rowSplit(cs))

f <- "case.org"
template <- readChar(f, file.info(f)$size)
f <- "person.org"
person <- readChar(f, file.info(f)$size)
f <- "symptoms.org"
symptoms <- readChar(f, file.info(f)$size)

text <- whisker.render(template, partials=list(person=person, symptoms=symptoms))
text <- gsub("[\r]", "", text)
text
#+end_src

#+RESULTS: sperson
:RESULTS:

   /Symptomatic Person[fn:: Person -- 4266]/
   
      #+Attr_Latex: :center nil :booktabs t
   |---------------------------+-------------------------------------------------------------------------------------------+----------|
   | Name                      | Nonso Khreis                                                                |          |
   | Sex \ldots Age \ldots DoB | male \ldots 30 \ldots 1984-09-11                                     |
   | Marital State             | separated (not living common law)                                                                          |          |
   | Home Address              | Woji Road \ldots Aiyekale \ldots Saki West \ldots Oyo                            |          |
   | Phone-1                   | 0813-4934620 mobile                                                                 |          |
   | Phone-2                   | NA NA                                                                 |          |
   | Occupation                | secondary school teacher                                                                            |          |
   |---------------------------+-------------------------------------------------------------------------------------------+----------|
   
   #+Attr_Latex: :center nil :booktabs t
   |--------------------------+-----------------------------------------+
   | Onset of Symptoms        | 2015-06-15   
   | Date of Death            | NA                         |
   |--------------------------+-----------------------------------------+
   | Fever \ldots Temp.       | no \ldots NA        |
   | Lethargy                 | yes                            |
   | Muscle Pain              | yes                          |
   | Headache                 | yes                            |
   |--------------------------+-----------------------------------------+
   | Stomach Pain             | no                         |
   | Diarrhea                 | no                            |
   | Vomiting                 | no                            |
   | Breathing Difficulties   | no                       |
   | Difficulty Swallowing    | no                      |
   | Hiccup                   | no                             |
   |--------------------------+-----------------------------------------+
   | Unexplained Bleeding     | no                       |
   |--------------------------+-----------------------------------------+
   | Anorexia                 | no                            |
   | Maculo-papular Rash      | no                              |
   | Unexplained Sudden Death | no                    |
   |--------------------------+-----------------------------------------+

   \medskip



:END:

** DONE Cases of Death

#+name: pdeath  
#+begin_src R :exports both :dir ../../doc.generation/mustache :results value org drawer :cache no :var iduser=usercode day=15
library(whisker)
cs <- read.csv2("../../data.out/ft_cases.csv", sep=";", header=TRUE, skip=0, 
  na.strings=c("","nil"), stringsAsFactors=FALSE)
cs <- cs[order(cs$IdPerson, cs$LastName), ]

cs <- cs[cs$IdUser==iduser,]
cs <- cs[cs$DateOfDeathDay==day,]
cs <- cs[!is.na(cs$DateOfDeathDay),]

case <- unname(rowSplit(cs))

f <- "case-death.org"
template <- readChar(f, file.info(f)$size)

text <- whisker.render(template)
text <- gsub("[\r]", "", text)
text
#+end_src

#+RESULTS: pdeath
:RESULTS:

   /Case of death[fn:: Person -- 4291]/

   #+Attr_Latex: :center nil :booktabs t
   |---------------------------+-----------------------------------------------|
   | Name                      | Kaneng Oshaniwa                    |
   | Sex \ldots DoB \ldots Age | female \ldots 45 \ldots 1969-03-08 |
   | Date of Death             | 2015-06-15                          |
   |---------------------------+-----------------------------------------------|
   
   \medskip
   /Case of death[fn:: Person -- 4408]/

   #+Attr_Latex: :center nil :booktabs t
   |---------------------------+-----------------------------------------------|
   | Name                      | Chimere Edeh                    |
   | Sex \ldots DoB \ldots Age | male \ldots 45 \ldots 1970-08-02 |
   | Date of Death             | 2015-06-15                          |
   |---------------------------+-----------------------------------------------|
   
   \medskip


:END:


